zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph3/PERI_NPX.h
#define NPX_NPXCR_GDE_MASK                       (0x70U)
#define NPX_NPXCR_GDE_SHIFT                      (4U)
/*! GDE - Global Decryption Enable
 *  0b010..Global decryption enabled. NPX on-the-fly decryption is globally enabled. Subsequent reads return 010b.
 *  0b101..Global decryption disabled. NPX on-the-fly decryption is globally disabled. Subsequent reads return 000b.
 */
#define NPX_NPXCR_GDE(x)                         (((uint32_t)(((uint32_t)(x)) << NPX_NPXCR_GDE_SHIFT)) & NPX_NPXCR_GDE_MASK)

#define NPX_NPXCR_SLK_MASK                       (0x700U)
#define NPX_NPXCR_SLK_SHIFT                      (8U)
/*! SLK - System Lock Enable
 *  0b010..Lock enabled: cannot write (via IPS) to keys, masks, regions, NPXCR (NPX Control Register), NPXSR (NPX
 *         Status Register). Subsequent reads return 010b.
 *  0b101..Lock disabled Subsequent reads return 000b.
 */
#define NPX_NPXCR_SLK(x)                         (((uint32_t)(((uint32_t)(x)) << NPX_NPXCR_SLK_SHIFT)) & NPX_NPXCR_SLK_MASK)

#define NPX_NPXCR_GLK_MASK                       (0x7000U)
#define NPX_NPXCR_GLK_SHIFT                      (12U)
/*! GLK - Global Lock Enable
 *  0b010..Lock enabled: cannot write to keys, masks, regions, NPXCR (NPX Control Register), NPXSR (NPX Status Register). Subsequent reads return 010b.
 *  0b101..Lock disabled. Subsequent reads return 000b.
 */
#define NPX_NPXCR_GLK(x)                         (((uint32_t)(((uint32_t)(x)) << NPX_NPXCR_GLK_SHIFT)) & NPX_NPXCR_GLK_MASK)
/*! @} */

/*! @name NPXSR - NPX Status Register */
/*! @{ */

#define NPX_NPXSR_NRGD_MASK                      (0xFU)
#define NPX_NPXSR_NRGD_SHIFT                     (0U)
/*! NRGD - Number of implemented memory regions
 *  0b0000..No (zero) implemented memory regions
 *  0b0001..1 implemented memory region
 *  0b0010..2 implemented memory regions
 *  0b0011..3 implemented memory regions
 *  0b0100..4 implemented memory regions
 */
#define NPX_NPXSR_NRGD(x)                        (((uint32_t)(((uint32_t)(x)) << NPX_NPXSR_NRGD_SHIFT)) & NPX_NPXSR_NRGD_MASK)

#define NPX_NPXSR_V0_MASK                        (0x100U)
#define NPX_NPXSR_V0_SHIFT                       (8U)
/*! V0 - Key n Valid
 *  0b0..Not valid
 *  0b1..Valid
 */
#define NPX_NPXSR_V0(x)                          (((uint32_t)(((uint32_t)(x)) << NPX_NPXSR_V0_SHIFT)) & NPX_NPXSR_V0_MASK)

#define NPX_NPXSR_V1_MASK                        (0x200U)
#define NPX_NPXSR_V1_SHIFT                       (9U)
/*! V1 - Key n Valid
 *  0b0..Not valid
 *  0b1..Valid
 */
#define NPX_NPXSR_V1(x)                          (((uint32_t)(((uint32_t)(x)) << NPX_NPXSR_V1_SHIFT)) & NPX_NPXSR_V1_MASK)

#define NPX_NPXSR_V2_MASK                        (0x400U)
#define NPX_NPXSR_V2_SHIFT                       (10U)
/*! V2 - Key n Valid
 *  0b0..Not valid
 *  0b1..Valid
 */
#define NPX_NPXSR_V2(x)                          (((uint32_t)(((uint32_t)(x)) << NPX_NPXSR_V2_SHIFT)) & NPX_NPXSR_V2_MASK)

#define NPX_NPXSR_V3_MASK                        (0x800U)
#define NPX_NPXSR_V3_SHIFT                       (11U)
/*! V3 - Key n Valid
 *  0b0..Not valid
 *  0b1..Valid
 */
#define NPX_NPXSR_V3(x)                          (((uint32_t)(((uint32_t)(x)) << NPX_NPXSR_V3_SHIFT)) & NPX_NPXSR_V3_MASK)
/*! @} */

/*! @name MRMASKEDKEYWORD0 - Memory Region 0, Masked Key Word 0..Memory Region 3, Masked Key Word 0 */
/*! @{ */

#define NPX_MRMASKEDKEYWORD0_MASKEDKEY0WORD0_MASK (0xFFFFFFFFU)
#define NPX_MRMASKEDKEYWORD0_MASKEDKEY0WORD0_SHIFT (0U)
/*! MASKEDKEY0WORD0 - Masked Key Word 0 */
#define NPX_MRMASKEDKEYWORD0_MASKEDKEY0WORD0(x)  (((uint32_t)(((uint32_t)(x)) << NPX_MRMASKEDKEYWORD0_MASKEDKEY0WORD0_SHIFT)) & NPX_MRMASKEDKEYWORD0_MASKEDKEY0WORD0_MASK)

#define NPX_MRMASKEDKEYWORD0_MASKEDKEY1WORD0_MASK (0xFFFFFFFFU)
#define NPX_MRMASKEDKEYWORD0_MASKEDKEY1WORD0_SHIFT (0U)
/*! MASKEDKEY1WORD0 - Masked Key Word 1 */
#define NPX_MRMASKEDKEYWORD0_MASKEDKEY1WORD0(x)  (((uint32_t)(((uint32_t)(x)) << NPX_MRMASKEDKEYWORD0_MASKEDKEY1WORD0_SHIFT)) & NPX_MRMASKEDKEYWORD0_MASKEDKEY1WORD0_MASK)

#define NPX_MRMASKEDKEYWORD0_MASKEDKEY2WORD0_MASK (0xFFFFFFFFU)
#define NPX_MRMASKEDKEYWORD0_MASKEDKEY2WORD0_SHIFT (0U)
/*! MASKEDKEY2WORD0 - Masked Key Word 2 */
#define NPX_MRMASKEDKEYWORD0_MASKEDKEY2WORD0(x)  (((uint32_t)(((uint32_t)(x)) << NPX_MRMASKEDKEYWORD0_MASKEDKEY2WORD0_SHIFT)) & NPX_MRMASKEDKEYWORD0_MASKEDKEY2WORD0_MASK)

#define NPX_MRMASKEDKEYWORD0_MASKEDKEY3WORD0_MASK (0xFFFFFFFFU)
#define NPX_MRMASKEDKEYWORD0_MASKEDKEY3WORD0_SHIFT (0U)
/*! MASKEDKEY3WORD0 - Masked Key Word 3 */
#define NPX_MRMASKEDKEYWORD0_MASKEDKEY3WORD0(x)  (((uint32_t)(((uint32_t)(x)) << NPX_MRMASKEDKEYWORD0_MASKEDKEY3WORD0_SHIFT)) & NPX_MRMASKEDKEYWORD0_MASKEDKEY3WORD0_MASK)
/*! @} */

/* The count of NPX_MRMASKEDKEYWORD0 */
#define NPX_MRMASKEDKEYWORD0_COUNT               (4U)

/*! @name MRMASKEDKEYWORD1 - Memory Region 0, Masked Key Word 1..Memory Region 3, Masked Key Word 1 */
/*! @{ */

#define NPX_MRMASKEDKEYWORD1_MASKEDKEY0WORD1_MASK (0xFFFFFFFFU)
#define NPX_MRMASKEDKEYWORD1_MASKEDKEY0WORD1_SHIFT (0U)
/*! MASKEDKEY0WORD1 - Masked Key Word 1 */
#define NPX_MRMASKEDKEYWORD1_MASKEDKEY0WORD1(x)  (((uint32_t)(((uint32_t)(x)) << NPX_MRMASKEDKEYWORD1_MASKEDKEY0WORD1_SHIFT)) & NPX_MRMASKEDKEYWORD1_MASKEDKEY0WORD1_MASK)

#define NPX_MRMASKEDKEYWORD1_MASKEDKEY1WORD1_MASK (0xFFFFFFFFU)
#define NPX_MRMASKEDKEYWORD1_MASKEDKEY1WORD1_SHIFT (0U)
/*! MASKEDKEY1WORD1 - Masked Key Word 1 */
#define NPX_MRMASKEDKEYWORD1_MASKEDKEY1WORD1(x)  (((uint32_t)(((uint32_t)(x)) << NPX_MRMASKEDKEYWORD1_MASKEDKEY1WORD1_SHIFT)) & NPX_MRMASKEDKEYWORD1_MASKEDKEY1WORD1_MASK)

#define NPX_MRMASKEDKEYWORD1_MASKEDKEY2WORD1_MASK (0xFFFFFFFFU)
#define NPX_MRMASKEDKEYWORD1_MASKEDKEY2WORD1_SHIFT (0U)
/*! MASKEDKEY2WORD1 - Masked Key Word 1 */
#define NPX_MRMASKEDKEYWORD1_MASKEDKEY2WORD1(x)  (((uint32_t)(((uint32_t)(x)) << NPX_MRMASKEDKEYWORD1_MASKEDKEY2WORD1_SHIFT)) & NPX_MRMASKEDKEYWORD1_MASKEDKEY2WORD1_MASK)

#define NPX_MRMASKEDKEYWORD1_MASKEDKEY3WORD1_MASK (0xFFFFFFFFU)
#define NPX_MRMASKEDKEYWORD1_MASKEDKEY3WORD1_SHIFT (0U)
/*! MASKEDKEY3WORD1 - Masked Key Word 1 */
#define NPX_MRMASKEDKEYWORD1_MASKEDKEY3WORD1(x)  (((uint32_t)(((uint32_t)(x)) << NPX_MRMASKEDKEYWORD1_MASKEDKEY3WORD1_SHIFT)) & NPX_MRMASKEDKEYWORD1_MASKEDKEY3WORD1_MASK)
/*! @} */

