zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph3/PERI_NPX.h
/* The count of NPX_MRMASKFORKEYWORD1 */
#define NPX_MRMASKFORKEYWORD1_COUNT              (4U)

/*! @name MRMASKFORKEYWORD2 - Memory Region 0, Mask for Key Word 2..Memory Region 3, Mask for Key Word 2 */
/*! @{ */

#define NPX_MRMASKFORKEYWORD2_MASK0WORD2_MASK    (0xFFFFFFFFU)
#define NPX_MRMASKFORKEYWORD2_MASK0WORD2_SHIFT   (0U)
/*! MASK0WORD2 - Mask for Key Word 2 */
#define NPX_MRMASKFORKEYWORD2_MASK0WORD2(x)      (((uint32_t)(((uint32_t)(x)) << NPX_MRMASKFORKEYWORD2_MASK0WORD2_SHIFT)) & NPX_MRMASKFORKEYWORD2_MASK0WORD2_MASK)

#define NPX_MRMASKFORKEYWORD2_MASK1WORD2_MASK    (0xFFFFFFFFU)
#define NPX_MRMASKFORKEYWORD2_MASK1WORD2_SHIFT   (0U)
/*! MASK1WORD2 - Mask for Key Word 2 */
#define NPX_MRMASKFORKEYWORD2_MASK1WORD2(x)      (((uint32_t)(((uint32_t)(x)) << NPX_MRMASKFORKEYWORD2_MASK1WORD2_SHIFT)) & NPX_MRMASKFORKEYWORD2_MASK1WORD2_MASK)

#define NPX_MRMASKFORKEYWORD2_MASK2WORD2_MASK    (0xFFFFFFFFU)
#define NPX_MRMASKFORKEYWORD2_MASK2WORD2_SHIFT   (0U)
/*! MASK2WORD2 - Mask for Key Word 2 */
#define NPX_MRMASKFORKEYWORD2_MASK2WORD2(x)      (((uint32_t)(((uint32_t)(x)) << NPX_MRMASKFORKEYWORD2_MASK2WORD2_SHIFT)) & NPX_MRMASKFORKEYWORD2_MASK2WORD2_MASK)

#define NPX_MRMASKFORKEYWORD2_MASK3WORD2_MASK    (0xFFFFFFFFU)
#define NPX_MRMASKFORKEYWORD2_MASK3WORD2_SHIFT   (0U)
/*! MASK3WORD2 - Mask for Key Word 2 */
#define NPX_MRMASKFORKEYWORD2_MASK3WORD2(x)      (((uint32_t)(((uint32_t)(x)) << NPX_MRMASKFORKEYWORD2_MASK3WORD2_SHIFT)) & NPX_MRMASKFORKEYWORD2_MASK3WORD2_MASK)
/*! @} */

/* The count of NPX_MRMASKFORKEYWORD2 */
#define NPX_MRMASKFORKEYWORD2_COUNT              (4U)

/*! @name MRMASKFORKEYWORD3 - Memory Region 0, Mask for Key Word 3..Memory Region 3, Mask for Key Word 3 */
/*! @{ */

#define NPX_MRMASKFORKEYWORD3_MASK0WORD3_MASK    (0xFFFFFFFFU)
#define NPX_MRMASKFORKEYWORD3_MASK0WORD3_SHIFT   (0U)
/*! MASK0WORD3 - Mask for Key Word 3 */
#define NPX_MRMASKFORKEYWORD3_MASK0WORD3(x)      (((uint32_t)(((uint32_t)(x)) << NPX_MRMASKFORKEYWORD3_MASK0WORD3_SHIFT)) & NPX_MRMASKFORKEYWORD3_MASK0WORD3_MASK)

#define NPX_MRMASKFORKEYWORD3_MASK1WORD3_MASK    (0xFFFFFFFFU)
#define NPX_MRMASKFORKEYWORD3_MASK1WORD3_SHIFT   (0U)
/*! MASK1WORD3 - Mask for Key Word 3 */
#define NPX_MRMASKFORKEYWORD3_MASK1WORD3(x)      (((uint32_t)(((uint32_t)(x)) << NPX_MRMASKFORKEYWORD3_MASK1WORD3_SHIFT)) & NPX_MRMASKFORKEYWORD3_MASK1WORD3_MASK)

#define NPX_MRMASKFORKEYWORD3_MASK2WORD3_MASK    (0xFFFFFFFFU)
#define NPX_MRMASKFORKEYWORD3_MASK2WORD3_SHIFT   (0U)
/*! MASK2WORD3 - Mask for Key Word 3 */
#define NPX_MRMASKFORKEYWORD3_MASK2WORD3(x)      (((uint32_t)(((uint32_t)(x)) << NPX_MRMASKFORKEYWORD3_MASK2WORD3_SHIFT)) & NPX_MRMASKFORKEYWORD3_MASK2WORD3_MASK)

#define NPX_MRMASKFORKEYWORD3_MASK3WORD3_MASK    (0xFFFFFFFFU)
#define NPX_MRMASKFORKEYWORD3_MASK3WORD3_SHIFT   (0U)
/*! MASK3WORD3 - Mask for Key Word 3 */
#define NPX_MRMASKFORKEYWORD3_MASK3WORD3(x)      (((uint32_t)(((uint32_t)(x)) << NPX_MRMASKFORKEYWORD3_MASK3WORD3_SHIFT)) & NPX_MRMASKFORKEYWORD3_MASK3WORD3_MASK)
/*! @} */

/* The count of NPX_MRMASKFORKEYWORD3 */
#define NPX_MRMASKFORKEYWORD3_COUNT              (4U)

/*! @name MRSTARTADDR - Memory Region 0 Start Address..Memory Region 3 Start Address */
/*! @{ */

#define NPX_MRSTARTADDR_SRTADDR0_MASK            (0xFFFFFE00U)
#define NPX_MRSTARTADDR_SRTADDR0_SHIFT           (9U)
/*! SRTADDR0 - Start Address for Memory Region 0 */
#define NPX_MRSTARTADDR_SRTADDR0(x)              (((uint32_t)(((uint32_t)(x)) << NPX_MRSTARTADDR_SRTADDR0_SHIFT)) & NPX_MRSTARTADDR_SRTADDR0_MASK)

#define NPX_MRSTARTADDR_SRTADDR1_MASK            (0xFFFFFE00U)
#define NPX_MRSTARTADDR_SRTADDR1_SHIFT           (9U)
/*! SRTADDR1 - Start Address for Memory Region 1 */
#define NPX_MRSTARTADDR_SRTADDR1(x)              (((uint32_t)(((uint32_t)(x)) << NPX_MRSTARTADDR_SRTADDR1_SHIFT)) & NPX_MRSTARTADDR_SRTADDR1_MASK)

#define NPX_MRSTARTADDR_SRTADDR2_MASK            (0xFFFFFE00U)
#define NPX_MRSTARTADDR_SRTADDR2_SHIFT           (9U)
/*! SRTADDR2 - Start Address for Memory Region 2 */
#define NPX_MRSTARTADDR_SRTADDR2(x)              (((uint32_t)(((uint32_t)(x)) << NPX_MRSTARTADDR_SRTADDR2_SHIFT)) & NPX_MRSTARTADDR_SRTADDR2_MASK)

#define NPX_MRSTARTADDR_SRTADDR3_MASK            (0xFFFFFE00U)
#define NPX_MRSTARTADDR_SRTADDR3_SHIFT           (9U)
/*! SRTADDR3 - Start Address for Memory Region 3 */
#define NPX_MRSTARTADDR_SRTADDR3(x)              (((uint32_t)(((uint32_t)(x)) << NPX_MRSTARTADDR_SRTADDR3_SHIFT)) & NPX_MRSTARTADDR_SRTADDR3_MASK)
/*! @} */

/* The count of NPX_MRSTARTADDR */
#define NPX_MRSTARTADDR_COUNT                    (4U)

/*! @name MRENDADDR - Memory Region 0 End Address..Memory Region 3 End Address */
/*! @{ */

#define NPX_MRENDADDR_V_MASK                     (0x7U)
#define NPX_MRENDADDR_V_SHIFT                    (0U)
/*! V - Memory Region 3 is Valid
 *  0b010..Memory Region 0 is valid. Subsequent reads return 111b.
 *  0b101..Memory Region 0 is not valid.
 */
#define NPX_MRENDADDR_V(x)                       (((uint32_t)(((uint32_t)(x)) << NPX_MRENDADDR_V_SHIFT)) & NPX_MRENDADDR_V_MASK)

#define NPX_MRENDADDR_ENDADDR0_MASK              (0xFFFFFE00U)
#define NPX_MRENDADDR_ENDADDR0_SHIFT             (9U)
/*! ENDADDR0 - End Address for Memory Region 0 */
#define NPX_MRENDADDR_ENDADDR0(x)                (((uint32_t)(((uint32_t)(x)) << NPX_MRENDADDR_ENDADDR0_SHIFT)) & NPX_MRENDADDR_ENDADDR0_MASK)

#define NPX_MRENDADDR_ENDADDR1_MASK              (0xFFFFFE00U)
#define NPX_MRENDADDR_ENDADDR1_SHIFT             (9U)
/*! ENDADDR1 - End Address for Memory Region 1 */
#define NPX_MRENDADDR_ENDADDR1(x)                (((uint32_t)(((uint32_t)(x)) << NPX_MRENDADDR_ENDADDR1_SHIFT)) & NPX_MRENDADDR_ENDADDR1_MASK)

#define NPX_MRENDADDR_ENDADDR2_MASK              (0xFFFFFE00U)
#define NPX_MRENDADDR_ENDADDR2_SHIFT             (9U)
/*! ENDADDR2 - End Address for Memory Region 2 */
#define NPX_MRENDADDR_ENDADDR2(x)                (((uint32_t)(((uint32_t)(x)) << NPX_MRENDADDR_ENDADDR2_SHIFT)) & NPX_MRENDADDR_ENDADDR2_MASK)

#define NPX_MRENDADDR_ENDADDR3_MASK              (0xFFFFFE00U)
#define NPX_MRENDADDR_ENDADDR3_SHIFT             (9U)
/*! ENDADDR3 - End Address for Memory Region 3 */
#define NPX_MRENDADDR_ENDADDR3(x)                (((uint32_t)(((uint32_t)(x)) << NPX_MRENDADDR_ENDADDR3_SHIFT)) & NPX_MRENDADDR_ENDADDR3_MASK)
/*! @} */

/* The count of NPX_MRENDADDR */
#define NPX_MRENDADDR_COUNT                      (4U)


/*!
 * @}
 */ /* end of group NPX_Register_Masks */


/*!
 * @}
 */ /* end of group NPX_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_NPX_H_ */

